RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/bl808.h
#if defined(CPU_D0)
    /******  BL808 specific Interrupt Numbers **********************************************************************/
    BMX_DSP_BUS_ERR_IRQn = IRQ_NUM_BASE + 0,  /*!< BMX DSP BUS Error Interrupt                                       */
    D0_RESERVED1_IRQn = IRQ_NUM_BASE + 1,     /*!< D0 reserved1 Interrupt                                            */
    D0_RESERVED2_IRQn = IRQ_NUM_BASE + 2,     /*!< IPC reserved Interrupt                                            */
    D0_RESERVED3_IRQn = IRQ_NUM_BASE + 3,     /*!< UART4 reserved Interrupt                                          */
    UART3_IRQn = IRQ_NUM_BASE + 4,            /*!< UART3 Interrupt                                                   */
    I2C2_IRQn = IRQ_NUM_BASE + 5,             /*!< I2C2 Interrupt                                                    */
    I2C3_IRQn = IRQ_NUM_BASE + 6,             /*!< I2C3 Interrupt                                                    */
    SPI1_IRQn = IRQ_NUM_BASE + 7,             /*!< SPI1 Interrupt                                                    */
    D0_RESERVED4_IRQn = IRQ_NUM_BASE + 8,     /*!< D0 reserved4 Interrupt                                            */
    D0_RESERVED5_IRQn = IRQ_NUM_BASE + 9,     /*!< D0 reserved5 Interrupt                                            */
    SEOF_INT0_IRQn = IRQ_NUM_BASE + 10,       /*!< SEOF INT0 Interrupt                                               */
    SEOF_INT1_IRQn = IRQ_NUM_BASE + 11,       /*!< SEOF INT1 Interrupt                                               */
    SEOF_INT2_IRQn = IRQ_NUM_BASE + 12,       /*!< SEOF INT2 Interrupt                                               */
    DVP2BUS_INT0_IRQn = IRQ_NUM_BASE + 13,    /*!< DVP2BUS INT0 Interrupt                                            */
    DVP2BUS_INT1_IRQn = IRQ_NUM_BASE + 14,    /*!< DVP2BUS INT1 Interrupt                                            */
    DVP2BUS_INT2_IRQn = IRQ_NUM_BASE + 15,    /*!< DVP2BUS INT2 Interrupt                                            */
    DVP2BUS_INT3_IRQn = IRQ_NUM_BASE + 16,    /*!< DVP2BUS INT3 Interrupt                                            */
    H264_BS_IRQn = IRQ_NUM_BASE + 17,         /*!< H264 BS Interrupt                                                 */
    H264_FRAME_IRQn = IRQ_NUM_BASE + 18,      /*!< H264 Frame Interrupt                                              */
    H264_SEQ_DONE_IRQn = IRQ_NUM_BASE + 19,   /*!< H264 SEQ Done Interrupt                                           */
    MJPEG_IRQn = IRQ_NUM_BASE + 20,           /*!< MJPEG Interrupt                                                   */
    H264_S_BS_IRQn = IRQ_NUM_BASE + 21,       /*!< H264 S BS Interrupt                                               */
    H264_S_FRAME_IRQn = IRQ_NUM_BASE + 22,    /*!< H264 S Frame Interrupt                                            */
    H264_S_SEQ_DONE_IRQn = IRQ_NUM_BASE + 23, /*!< H264 S SEQ Done Interrupt                                         */
    DMA2_INT0_IRQn = IRQ_NUM_BASE + 24,       /*!< DMA2 INT0 Interrupt                                               */
    DMA2_INT1_IRQn = IRQ_NUM_BASE + 25,       /*!< DMA2 INT1 Interrupt                                               */
    DMA2_INT2_IRQn = IRQ_NUM_BASE + 26,       /*!< DMA2 INT2 Interrupt                                               */
    DMA2_INT3_IRQn = IRQ_NUM_BASE + 27,       /*!< DMA2 INT3 Interrupt                                               */
    DMA2_INT4_IRQn = IRQ_NUM_BASE + 28,       /*!< DMA2 INT4 Interrupt                                               */
    DMA2_INT5_IRQn = IRQ_NUM_BASE + 29,       /*!< DMA2 INT5 Interrupt                                               */
    DMA2_INT6_IRQn = IRQ_NUM_BASE + 30,       /*!< DMA2 INT6 Interrupt                                               */
    DMA2_INT7_IRQn = IRQ_NUM_BASE + 31,       /*!< DMA2 INT7 Interrupt                                               */
    SDH_MMC1_IRQn = IRQ_NUM_BASE + 32,        /*!< SDH MMC1 Interrupt                                                */
    SDH_MMC3_IRQn = IRQ_NUM_BASE + 33,        /*!< SDH MMC3 Interrupt                                                */
    SDH2PMU_WAKEUP1_IRQn = IRQ_NUM_BASE + 34, /*!< SDH2PMU Wakeup1 Interrupt                                         */
    SDH2PMU_WAKEUP3_IRQn = IRQ_NUM_BASE + 35, /*!< SDH2PMU Wakeup3 Interrupt                                         */
    EMAC2_IRQn = IRQ_NUM_BASE + 36,           /*!< EMAC2 Interrupt                                                   */
    MIPI_CSI_IRQn = IRQ_NUM_BASE + 37,        /*!< MIPI CSI Interrupt                                                */
    IPC_D0_IRQn = IRQ_NUM_BASE + 38,          /*!< IPC D0 Interrupt                                                  */
    APU_IRQn = IRQ_NUM_BASE + 39,             /*!< APU Interrupt                                                     */
    MJDEC_IRQn = IRQ_NUM_BASE + 40,           /*!< MJDEC Interrupt                                                   */
    DVP2BUS_INT4_IRQn = IRQ_NUM_BASE + 41,    /*!< DVP2BUS INT4 Interrupt                                            */
    DVP2BUS_INT5_IRQn = IRQ_NUM_BASE + 42,    /*!< DVP2BUS INT5 Interrupt                                            */
    DVP2BUS_INT6_IRQn = IRQ_NUM_BASE + 43,    /*!< DVP2BUS INT6 Interrupt                                            */
    DVP2BUS_INT7_IRQn = IRQ_NUM_BASE + 44,    /*!< DVP2BUS INT7 Interrupt                                            */
    DMA2D_INT0_IRQn = IRQ_NUM_BASE + 45,      /*!< DMA2D INT0 Interrupt                                              */
    DMA2D_INT1_IRQn = IRQ_NUM_BASE + 46,      /*!< DMA2D INT1 Interrupt                                              */
    DISPLAY_IRQn = IRQ_NUM_BASE + 47,         /*!< Display Interrupt                                                 */
    PWM_IRQn = IRQ_NUM_BASE + 48,             /*!< PWM1 Interrupt                                                    */
    SEOF_INT3_IRQn = IRQ_NUM_BASE + 49,       /*!< SEOF INT0 Interrupt                                               */
    RESERVED1_IRQn = IRQ_NUM_BASE + 50,       /*!< Reserved Interrupt                                                */
    RESERVED2_IRQn = IRQ_NUM_BASE + 51,       /*!< Reserved Interrupt                                                */
    OSD_IRQn = IRQ_NUM_BASE + 52,             /*!< OSD Interrupt                                                     */
    DBI_IRQn = IRQ_NUM_BASE + 53,             /*!< DBI Interrupt                                                     */
    D0_RESERVED6_IRQn = IRQ_NUM_BASE + 54,    /*!< D0_RESERVED6 Interrupt                                            */
    OSDA_BUS_DRAIN_IRQn = IRQ_NUM_BASE + 55,  /*!< OSDA Bus Drain Interrupt                                          */
    OSDB_BUS_DRAIN_IRQn = IRQ_NUM_BASE + 56,  /*!< OSDB Bus Drain Interrupt                                          */
    OSD_PB_IRQn = IRQ_NUM_BASE + 57,          /*!< OSD PB Interrupt                                                  */
    D0_RESERVED7_IRQn = IRQ_NUM_BASE + 58,    /*!< D0_RESERVED7 Interrupt                                            */
    MIPI_DSI_IRQn = IRQ_NUM_BASE + 59,        /*!< MIPI DSI Interrupt                                                */
    D0_RESERVED8_IRQn = IRQ_NUM_BASE + 60,    /*!< D0_RESERVED8 Interrupt                                            */
    TIMER1_CH0_IRQn = IRQ_NUM_BASE + 61,      /*!< Timer1 Channel 0 Interrupt                                        */
    TIMER1_CH1_IRQn = IRQ_NUM_BASE + 62,      /*!< Timer1 Channel 1 Interrupt                                        */
    TIMER1_WDT_IRQn = IRQ_NUM_BASE + 63,      /*!< Timer1 Watch Dog Interrupt                                        */
    AUDIO_IRQn = IRQ_NUM_BASE + 64,           /*!< Audio Interrupt                                                   */
    WL_ALL_IRQn = IRQ_NUM_BASE + 65,          /*!< WL System All Interrupt                                           */
    PDS_IRQn = IRQ_NUM_BASE + 66,             /*!< PDS Interrupt                                                     */
    IRQn_LAST,
#endif
} IRQn_Type;

/* Add following macro definition in order to pass the compilation */
#if defined(CPU_M0) || defined(CPU_LP)
#define BMX_DSP_BUS_ERR_IRQn (IRQn_LAST)
#define D0_RESERVED1_IRQn    (IRQn_LAST)
#define D0_RESERVED2_IRQn    (IRQn_LAST)
#define UART3_IRQn           (IRQn_LAST)
#define I2C2_IRQn            (IRQn_LAST)
#define I2C3_IRQn            (IRQn_LAST)
#define SPI1_IRQn            (IRQn_LAST)
#define D0_RESERVED4_IRQn    (IRQn_LAST)
#define D0_RESERVED5_IRQn    (IRQn_LAST)
#define SEOF_INT0_IRQn       (IRQn_LAST)
#define SEOF_INT1_IRQn       (IRQn_LAST)
#define SEOF_INT2_IRQn       (IRQn_LAST)
#define DVP2BUS_INT0_IRQn    (IRQn_LAST)
#define DVP2BUS_INT1_IRQn    (IRQn_LAST)
#define DVP2BUS_INT2_IRQn    (IRQn_LAST)
#define DVP2BUS_INT3_IRQn    (IRQn_LAST)
#define H264_BS_IRQn         (IRQn_LAST)
#define H264_FRAME_IRQn      (IRQn_LAST)
#define H264_SEQ_DONE_IRQn   (IRQn_LAST)
#define MJPEG_IRQn           (IRQn_LAST)
#define H264_S_BS_IRQn       (IRQn_LAST)
#define H264_S_FRAME_IRQn    (IRQn_LAST)
#define H264_S_SEQ_DONE_IRQn (IRQn_LAST)
#define DMA2_INT0_IRQn       (IRQn_LAST)
#define DMA2_INT1_IRQn       (IRQn_LAST)
#define DMA2_INT2_IRQn       (IRQn_LAST)
#define DMA2_INT3_IRQn       (IRQn_LAST)
#define DMA2_INT4_IRQn       (IRQn_LAST)
#define DMA2_INT5_IRQn       (IRQn_LAST)
#define DMA2_INT6_IRQn       (IRQn_LAST)
#define DMA2_INT7_IRQn       (IRQn_LAST)
#define SDH_MMC1_IRQn        (IRQn_LAST)
#define SDH_MMC3_IRQn        (IRQn_LAST)
#define SDH2PMU_WAKEUP1_IRQn (IRQn_LAST)
#define SDH2PMU_WAKEUP3_IRQn (IRQn_LAST)
#define EMAC2_IRQn           (IRQn_LAST)
#define MIPI_CSI_IRQn        (IRQn_LAST)
#define IPC_D0_IRQn          (IRQn_LAST)
#define APU_IRQn             (IRQn_LAST)
#define MJDEC_IRQn           (IRQn_LAST)
#define DVP2BUS_INT4_IRQn    (IRQn_LAST)
#define DVP2BUS_INT5_IRQn    (IRQn_LAST)
#define DVP2BUS_INT6_IRQn    (IRQn_LAST)
#define DVP2BUS_INT7_IRQn    (IRQn_LAST)
#define DMA2D_INT0_IRQn      (IRQn_LAST)
#define DMA2D_INT1_IRQn      (IRQn_LAST)
#define DISPLAY_IRQn         (IRQn_LAST)
#define SEOF_INT3_IRQn       (IRQn_LAST)
#define RESERVED1_IRQn       (IRQn_LAST)
#define RESERVED2_IRQn       (IRQn_LAST)
#define OSD_IRQn             (IRQn_LAST)
#define DBI_IRQn             (IRQn_LAST)
#define D0_RESERVED6_IRQn    (IRQn_LAST)
#define OSDA_BUS_DRAIN_IRQn  (IRQn_LAST)
#define OSDB_BUS_DRAIN_IRQn  (IRQn_LAST)
#define OSD_PB_IRQn          (IRQn_LAST)
#define D0_RESERVED7_IRQn    (IRQn_LAST)
#define MIPI_DSI_IRQn        (IRQn_LAST)
#define D0_RESERVED8_IRQn    (IRQn_LAST)
#define TIMER1_CH0_IRQn      (IRQn_LAST)
#define TIMER1_CH1_IRQn      (IRQn_LAST)
#define TIMER1_WDT_IRQn      (IRQn_LAST)
#define WL_ALL_IRQn          (IRQn_LAST)
#define PDS_IRQn             (IRQn_LAST)
#endif

